Repository: threadi/external-files-from-aws-s3
Catalog: languages/external-files-from-aws-s3-*.po
Languages: de_de

source: External files from AWS S3 in Media Library
de_de: Externe Dateien aus AWS S3 in der Mediathek

source: Extends External files in Media Library for usage AWS S3.
de_de: Erweitert externe Dateien in der Mediathek für die Verwendung von AWS S3.

source: Choose file(s) from your AWS S3 server
de_de: Wähle Datei(en) von deinem AWS S3 Server

source: No files returned from AWS S3.
de_de: Keine Dateien von AWS S3 erhalten.

source: Credentials and/or bucket are not valid. AWS S3 returns with HTTP-Status %1$d!
de_de: Anmeldedaten und/oder Bucket sind ungültig. AWS S3 gibt den HTTP-Status %1$d zurück!

source: Import
de_de: Importieren

source: File-type is not supported
de_de: Der Dateityp wird nicht unterstützt

source: Go to AWS S3 Bucket
de_de: Gehe zu deinem AWS S3 Bucket

source: Import active directory
de_de: Importiere aktuelles Verzeichnis

source: Save active directory as your external source
de_de: Speicher das aktuelle Verzeichnis als externe Quelle

source: No credentials set for this AWS S3 connection!
de_de: Keine Zugangsdaten für die AWS S3 Verbindung gesetzt!

source: Credentials and/or bucket are not valid. AWS S3 returns with HTTP-Status %1$d! Error:
de_de: Zugangsdaten und/oder Bucket sind ungültig. AWS S3 gibt den HTTP-Status %1$d zurück! Fehler:

source: Access key
de_de: Zugriffstoken

source: Get your access key as described <a href="%1$s" target="_blank">here (opens in a new window)</a>.
de_de: Erhalte deinen Zugangstoken wie <a href="%1$s" target="_blank">hier (öffnet neues Fenster)</a> beschrieben.

source: The access key
de_de: Der Zugriffstoken

source: Secret key
de_de: Geheimer Schlüssel

source: The secret key
de_de: Der geheime Schlüssel

source: The bucket you want to use.
de_de: Das Bucket was du nutzen willst.

source: Hint
de_de: Hinweis

source: Each user will find its settings in his own <a href="%1$s">user profile</a>.
de_de: Jeder Benutzer findet seine Einstellungen in seinem eigenem <a href="%1$s">Benutzerprofil</a>.

source: Choose the region
de_de: Wähle die Region

source: Max. files to load during import per iteration
de_de: Maximale Anzahl Dateien pro Durchlauf

source: This value specifies how many files should be loaded during a directory import. The higher the value, the greater the likelihood of timeouts during import.
de_de: Dieser Wert gibt an, wie viele Dateien beim Importieren eines Verzeichnisses geladen werden sollen. Je höher der Wert, desto größer ist die Wahrscheinlichkeit, dass es während des Imports zu Zeitüberschreitungen kommt.

source: The bucket you want to use
de_de: Das Bucket das du verwenden willst

source: Choose your region
de_de: Wähle deine Region

source: The region the bucket is located in
de_de: Die Region in der das Bucket lokalisiert ist

source: Connect to your AWS S3
de_de: Verbinde zu deinem AWS S3

source: Enter your credentials
de_de: Gibt deine Zugangsdaten ein

source: An authentication JSON has already been set by an administrator in the plugin settings. Just connect for show the files.
de_de: Eine Authentifizierungs-JSON wurde bereits von einem Administrator in den Plugin-Einstellungen festgelegt. Stelle einfach eine Verbindung her, um die Dateien anzuzeigen.

source: An authentication JSON must be set by an administrator in the plugin settings.
de_de: Eine Authentifizierungs-JSON muss von einem Administrator in den Plugin-Einstellungen festgelegt werden.

source: Set your authentication JSON <a href="%1$s">here</a>.
de_de: Lege deine Authentifizierungs-JSON <a href="%1$s">hier</a> fest.

source: Your access token is already set <a href="%1$s">here</a>. Just connect for show the files.
de_de: Dein Zugriffstoken ist bereits <a href="%1$s">hier</a> eingerichtet. Stelle einfach eine Verbindung her, um die Dateien anzuzeigen.

source: Set your authentication JSON <a href="%1$s">in your profile</a>.
de_de: Lege deine Authentifizierungs-JSON <a href="%1$s">in deinem Profil</a> fest.

source: Your authentication JSON is already set <a href="%1$s">in your profile</a>. Just connect for show the files.
de_de: Deine Authentifizierungs-JSON ist bereits <a href="%1$s">in deinem Profil</a> festgelegt. Stelle einfach eine Verbindung her, um die Dateien anzuzeigen.

source: Enter your AWS S3 credentials in this form. How to obtain them is described <a href="%1$s">here</a>.
de_de: Gibt deine AWS S3 Zugangsdaten in diesem Formular ein. Wie du diese erhältst, ist <a href="%1$s">hier</a> beschrieben.

source: Given path is not a AWS S3-URL.
de_de: Angegebener Pfad ist keine gültige AWS S3-URL.

source: Exporting attachment ID %1$s to AWS S3 bucket %2$s.
de_de: Exportiere Anhand ID %1$s zum AWS S3 Bucket %2$s.

source: File would not be public available on your AWS S3 bucket. Check the settings in the bucket to use the export of files.
de_de: Die Datei wäre nicht öffentlich in deinem AWS S3 Bucket erreichbar. Prüfe die Einstellungen im Bucket, um den Export von Dateien dorthin zu ermöglichen.

source: File could not be deleted! Error:
de_de: Datei konnte nicht gelöscht werden! Fehler:

source: Error during request of AWS S3 file. <a href="%1$s">Check the log</a> for details.
de_de: Fehler bei Anfrage einer AWS S3 Datei. <a href="%1$s">Prüfe das Protokoll</a> für Details.

source: Error during request of AWS S3 file:
de_de: Fehler beim Abrufen einer AWS S3 Datei:
